---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ServiceId
source: html/4a076870-642f-4287-3ddc-c251890618c9.htm
---
# Autodesk.Revit.DB.FabricationPart.ServiceId Property

The fabrication part service identifier. The service can only be changed to compatible services.

## Syntax (C#)
```csharp
public int ServiceId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: